[
  {
    "gameId": "",
    "gameName": "Campfire Stories",
    "year": 2017,
    "description": "Campfire Stories is a turn-based travelling game about impressing people with your heroic deeds. The more affected your audience is by your storytelling, the more successful you are. But simply telling a compelling story may not be enough: bringing trophies from your journeys will captivate your audience, and may offer proof that can convince sceptics.<br><br>In the game you will be travelling on a large tile-based map representing Ancient Greece. While you can find adventures in historical cities such as Sparta and Athens, you will have to go into the wild to meet real challenges. But traveling through the wilderness will wear you out, and diminish your energy to act as a real hero. Don’t forget to rest after tiring walks, but be prepared to leave as soon as possible.<br><br>Sometimes you have to fight against historical figures and mystical creatures. If there are no centaurs or three-headed dogs nearby, you may have to find a way to make up your own epic story. In the end, history is always written by the winners, and it is all up your story-telling skills. Try to collect as many convincing objects as possible and balance your ‘exaggerations’ to present an epic, yet credible experience for the listeners.",
    "genre": ["story simlator", "rpg"],
    "screenshots": [],
    "tileImage": ""
  },
  {
    "gameId": "",
    "gameName": "Bards, Bees and Birds",
    "year": 2015,
    "description": "Bards, Bees and Birds is a game about exploration and musical combat. Step into a world full of interesting places and discover unique locations, meet memorable characters and engage in witty dialogues. In 2015 the first demo The Mask of Mockery was created. You can download Version 1.02 for Windows via this link.<br><br>In Bards, Bees and Birds you follow Emmon Tumblescream who, while learning to become a minstrel, is called on an important quest, involving outrageous dragons, hideous music teachers, wise cats and ever more birds and bards and bees.## Gameplay<br>One big influence on the game is the classic old point-and-click genre. This means that in BBB you will progress through the story by examining the world around you and by talking to the game's many intriguing characters. In the world of BBB a serious amount of silliness awaits you.<br><br>You will find influences from RPG games; this means item collecting, map exploring and levelling! And then there is combat...<br><br>Combat will have a slightly unusual shape, as the hero of our game is slightly unusual. As a minstrel, our hero will rely on his musical instruments to fight off anyone who tries to keep him from achieving his noble goals.<br><br>His musical performances will smite or confuse his enemies to their doom. This takes place in the form of a rhythm game, in which the player needs to hit the notes on the right moments to successfully outperform his enemies.<br>## Demo 1: The Mask of Mockery<br>The first demo of Bards, Bees and Birds was released in January 2016. In the demo we first meet our hero, Emmon Tumblescream, who is looking for a musical instrument (not unimportant for a minstrel).<br><br>However, Benny Twospoons, a retired clown, and the mysterious Tear Collector distract Emmon from his job and instead send him on a quest to retrieve the legendary Mask of Mockery.<br><br>Demo 1: The Mask of Mockery lets the player first enter the world of Bards, Bees and Birds. Some of the features introduced are: a dialogue system, an item and inventory system, interaction with objects in the world and a save and load game. [You can download the Bards, Bees and Birds demo.zip here](http://haddockheadstudios.com/games/Bards-Bees-and-Birds-1.0.5.zip).",
    "genre": ["point-and-click", "rpg", "drumming game"],
    "screenshots": [],
    "tileImage": ""
  },
  {
    "gameId": "",
    "gameName": "History Hustle",
    "year": 2017,
    "description": "History Hustle is a multiplayer history quiz app for iOS devices. Challenge your friends and try to put interesting historical facts in the right chronological order. This is not only a fun challenge, but interesting as well, as you will suddenly see which events you didn’t connect to each other before were actually happening at the same time!##Gameplay<br>Each turn you will choose one of the events in front of you and put it in the right spot in the timeline. You cannot see the actual date of any of the other events in the timeline so you can only make an educated guess.<br><br>In many cases you might not be familiar with the events in front of you. However, each text contains hints from which you can estimate when the event could have happened. Maybe you can understand the context because of a story you once heard, or a novel you read in your childhood.<br><br>If you think that your opponent has made a mistake, you can claim that there is a mistake in the timeline. The real dates of the events in the timeline are now revealed. Were you correct? Good for you! You will win this round and earn points. But be careful: if your claim is false, however, you will lose points.## Features<br>The game can be played multiplayer, or alone against the computer. When setting up the game you can decide what kind of historical events you want to include in your game. By default you can encounter any event, from the building of the pyramids, to the landing on the moon. However, for a more specialised approach you can also pick only “American History”, or “Art and Literature” or one of the many other categories. Maybe you are most interested in the 20th century? It is also possible to just play with the events from your favourite period in history.",
    "genre": ["history quiz, multiplayer"],
    "screenshots": [],
    "tileImage": ""
  }
]
